In [1]:
a={"name":["chandan","amit"],"age":[29,28]}
b=[11,12,13,14,15]

In [2]:
import pandas as pd

In [3]:
bb=pd.Series(b)
aa=pd.DataFrame(a)

In [4]:
aa

      name  age
0  chandan   29
1     amit   28

In [5]:
aa.keys

<bound method NDFrame.keys of       name  age
0  chandan   29
1     amit   28>

In [6]:
bb=pd.Series(b)
aa=pd.DataFrame(a,index=["one","two"])

In [7]:
aa

        name  age
one  chandan   29
two     amit   28

In [8]:
aa.keys

<bound method NDFrame.keys of         name  age
one  chandan   29
two     amit   28>

In [9]:
import pandas as pd

In [11]:
mydata=pd.read_csv(r"C:\Users\Lenovo\Desktop\AI\Ml_Data\Bmi_male_female.csv")

In [12]:
mydata

     Gender  Height  Weight  Index
0      Male     174      96      4
1      Male     189      87      2
2    Female     185     110      4
3    Female     195     104      3
4      Male     149      61      3
..      ...     ...     ...    ...
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5
498    Male     150      95      5
499    Male     173     131      5

[500 rows x 4 columns]

In [13]:
mydata.iloc[2:10,:]

   Gender  Height  Weight  Index
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3
5    Male     189     104      3
6    Male     147      92      5
7    Male     154     111      5
8    Male     174      90      3
9  Female     169     103      4

In [14]:
#to find no. of females

In [15]:
mydata.Gender=="Female"

0      False
1      False
2       True
3       True
4      False
       ...
495     True
496     True
497     True
498    False
499    False
Name: Gender, Length: 500, dtype: bool

In [16]:
mydata[mydata.Gender=="Female"]

     Gender  Height  Weight  Index
2    Female     185     110      4
3    Female     195     104      3
9    Female     169     103      4
11   Female     159      80      4
12   Female     192     101      3
..      ...     ...     ...    ...
492  Female     198      50      0
493  Female     170      53      1
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5

[255 rows x 4 columns]

In [17]:
mydata.head()

   Gender  Height  Weight  Index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3

In [18]:
X_input=mydata.iloc[:,0:3]

In [19]:
X_input

     Gender  Height  Weight
0      Male     174      96
1      Male     189      87
2    Female     185     110
3    Female     195     104
4      Male     149      61
..      ...     ...     ...
495  Female     150     153
496  Female     184     121
497  Female     141     136
498    Male     150      95
499    Male     173     131

[500 rows x 3 columns]

In [20]:
y_input=mydata.iloc[:-2]

In [21]:
y_input

     Gender  Height  Weight  Index
0      Male     174      96      4
1      Male     189      87      2
2    Female     185     110      4
3    Female     195     104      3
4      Male     149      61      3
..      ...     ...     ...    ...
493  Female     170      53      1
494    Male     152      98      5
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5

[498 rows x 4 columns]

In [22]:
Index_name=pd.Series(["extremely weak","weak","normal","gym ja","motapa kum kar","mar jayega"])

In [23]:
Index_name

0    extremely weak
1              weak
2            normal
3            gym ja
4    motapa kum kar
5        mar jayega
dtype: object

In [24]:
mydata.Index==4

0       True
1      False
2       True
3      False
4      False
       ...
495    False
496     True
497    False
498    False
499    False
Name: Index, Length: 500, dtype: bool

In [25]:
import pandas as pd

In [28]:
mydata=pd.read_csv(r"C:\Users\Lenovo\Desktop\AI\Ml_Data\Bmi_male_female.csv")

In [29]:
x_input=mydata.iloc[:,0:3]
y_input=mydata.iloc[:,3]

In [30]:
x_input.Gender[x_input.Gender=="Male"]=0
x_input.Gender[x_input.Gender=="Female"]=1

C:\Users\Lenovo\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Lenovo\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [31]:
x_input.head()

  Gender  Height  Weight
0      0     174      96
1      0     189      87
2      1     185     110
3      1     195     104
4      0     149      61

In [32]:
from sklearn.model_selection import train_test_split

In [33]:
x_train,x_test,y_train,y_test=train_test_split(x_input,y_input,test_size=.30)

In [34]:
x_train

    Gender  Height  Weight
338      1     189     125
264      0     147      84
88       1     159     104
300      1     186     140
26       0     190      95
..     ...     ...     ...
159      0     181     105
298      1     187      92
84       0     168     123
62       0     193      54
76       0     165     104

[350 rows x 3 columns]

In [35]:
x_train.shape

(350, 3)